// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = -3;

if(a !== 0){
    console.log('Вірно')
} else {
    console.log('Невірно')
}
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time =0;

if(time >=0 && time <15){
    console.log('Перша чверть')
} else if (time >=15 && time < 30){
    console.log('Друга чверть')
} else if (time >=30 && time <45){
    console.log('Третя чверть')
} else if (time >=45 && time <60){
    console.log('Четверта частина години')
} else {
    console.log('Такої хвилини в годині нема,друже')
}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = 22;

if(day >= 1 && day < 11){
    console.log('Перща частина місяця')
} else if(day >= 11 && day < 21){
    console.log('Друга частина місяця')
} else if(day >= 21 && day <=31){
    console.log('Третя частина місяця')
} else {
    console.log('Не буває такого дня в місяці')
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let dayCount = 5;

switch (dayCount){
    case 1 :
        console.log('Поприбирати')
        break;
    case 2:
        console.log('Помитися')
        break;
    case 3:
        console.log('Почмирити русню в неті')
        break;
    case 4:
        console.log('Приготувати їсти')
        break;
    case 5:
        console.log('Прибрати за котом')
        break;
    case 6:
        console.log('Помити вікна')
        break;
    case 7:
        console.log('Послухати лекцію Сергія')
        break
}
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let y = +prompt('choose your first number');
let z = +prompt('choose your second number');

if(y>z){
    console.log(y)
} else if(z>a){
    console.log(z)
} else {
    console.log(y,z)
}